<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases
</span>
</center></b>
</span><br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Lecture 5: <br>Entity-Relationship Model and SQL Continued<br>(Continued)
</span>
</center></i>

<u><span style="font-size: 24px;">Lecture Overview</span></u>
<br><br>
1. Questions and comments.<br><br>
1. REST<br><br>
1. SQL Continued:
    - JOIN
    - Views
    - Integrity Constraints
    - Functions and Procedures
    - Triggers
    - Recursive Queries<br><br>
1. Extended Entity-Relationship Modeling Example; Putting Some Pieces Together

<u><span style="font-size: 24px;">Initialize Environment</span></u>
<br><br>

In [34]:
%load_ext sql
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost/W4111GoTSolutionClean

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: dbuser@W4111GoTSolutionClean'

# REST

## Web Applications Reminder


| <img src="../../images/web_app_layers.jpg"> |
| :---: |
| __Web Application Layers/Microservices__ |


- We will be working to publish REST APIs to data and also complementing data with REST APIs.


- We will try to do some UI, or mostly I will, but this is a completely separate, large domain.

## Representational State Transfer

### Common Database Concepts

- Almost all database engines and models have the concepts of
    - Objects that are some form of array of (name, value) pairs.
    - Sets of similar or related objects.
    - Four basic (CRUD) operations on a set
        - CREATE a new object and add to a set.
        - RETRIEVE an object in a set based on a criteria.
        - UPDATE an object in a set, e.g. change the data in the object.
        - DELETE an object from a set, specifying the object(s) by some criteria.
        
        
- In the file systems/CSV model (HW 1a)
    - A set is a file, e.g. People.csv.
    - Each object is a row in the file.
    - The header row gives the names of each column.
    - The CRUD processing involves writing a program that reads the file, changes the two-dimensional array and writing the file.
        - CREATE: Append a row and save the file.
        - RETRIEVE: Scan the table and apply some kind of IF statement.
        - UPDATE: Change a row in the two dimensional array.
        - DELETE: Remove a row from the array.
        

- In the "pure" relational model
    - A set is a _relation_.
    - An object is a _row_ or _tuple_.
    - There is no support for CREATE, UPDATE or DELETE.
    - There is an _algebra_ and language from producing a new relation from existing relations that implements a support set of RETRIEVE.
    
    
- In SQL,
    - A set is a _table_.
    - An object is a _row_ or _tuple_.
    - INSERT is the create operation.
    - UPDATE is the delete operation.
    - DELETE is the delete operation.
    - SELECT is the statement that realizes the relational _algebra_.
    
    
- In the web (http) and [Representational state transfer](https://en.wikipedia.org/wiki/Representational_state_transfer) REST.
    - A set is a _resource_ that is a collection of _resources._
    - An object is a resource.
    - CREATE is HTTP POST
    - RETRIEVE is HTTP GET
    - UPDATE is HTTP PUT (or PATCH)
    - DELETE is HTTP DELETE.

### REST Concepts

#### Resource

| <img src="../../images/rest_concepts.png"> |
| :---: |
| [Resource Concept](https://restful-api-design.readthedocs.io/en/latest/resources.html) |

"The fundamental concept in any RESTful API is the resource. A resource is an object with a type, associated data, relationships to other resources, and a set of methods that operate on it. It is similar to an object instance in an object-oriented programming language, with the important difference that only a few standard methods are defined for the resource (corresponding to the standard HTTP GET, POST, PUT and DELETE methods), while an object instance typically has many methods.

Resources can be grouped into collections. Each collection is homogeneous so that it contains only one type of resource, and unordered. Resources can also exist outside any collection. In this case, we refer to these resources as singleton resources. Collections are themselves resources as well.

Collections can exist globally, at the top level of an API, but can also be contained inside a single resource. In the latter case, we refer to these collections as sub-collections. Sub-collections are usually used to express some kind of “contained in” relationship. We go into more detail on this in Relationships." (https://restful-api-design.readthedocs.io/en/latest/resources.html)

- Simplistic mapping to relational/SQL
    - Collection is a table.
    - Resource is a row/tuple.
    - Sub-resource is a _dependent entity_ (aka _weak entity._)
    - Sub-resource collection is the set of dependent entities that are dependent on/contained by the containing resource.
    
"In a relational database, a weak entity is an entity that cannot be uniquely identified by its attributes alone; therefore, it must use a foreign key in conjunction with its attributes to create a primary key. The foreign key is typically a primary key of an entity it is related to." (https://en.wikipedia.org/wiki/Weak_entity)

| <img src="../../images/orders_weak.jpeg"> |
| :---: |
| __Relationships__ |

- In the [classic cars database example:](http://www.mysqltutorial.org/mysql-sample-database.aspx)
    - _orderdetails_ is a dependent/weak entity/sub-resource that _orders_ logically contains.
    - The relationship is different than the relationship between _customers_ and _orders_ or _orderdetails_ and _products._

#### API and Protocol

| <img src="../../images/http_rest_protocol.jpeg" > |
| :---: |
| __HTTP and REST__ |

- The CRUD verbs are:
    - ```POST```
    - ```GET```
    - ```PUT``` (some designs use ```PATCH``` instead of ```PUT.```)
    - ```DELETE```

- The CRUD verbs occur on resources that a ```URL``` (```PATH```) identify.


- - "A Uniform Resource Locator (URL), colloquially termed a web address, is a reference to a web resource that specifies its location on a computer network and a mechanism for retrieving it. A URL is a specific type of Uniform Resource Identifier (URI), although many people use the two terms interchangeably. URLs occur most commonly to reference web pages (http), but are also used for file transfer (ftp), email (mailto), database access (JDBC), and many other applications." (https://en.wikipedia.org/wiki/URL)


- A URL has the format


```URI = scheme:[//authority]path[?query][#fragment]```


- The components are:
    1. Scheme: Information about the protocol, connector library, ...
    2. Authority: Usually ```userid:password```.
    3. Path: File system like folder path to the resource.
    4. We will cover query string later.
    5. Fragment: A location or subset of the resource, e.g. a section with heading.
    
- URL paths have a pattern in most applications

| Path | Mapping |
| :---: | :--- |
| /api	| The API entry point |
| /api/:coll	| A top-level collection named “coll” |
| /api/:coll/:id	| The resource “id” inside/related to collection “coll” |
| /api/:coll/:id/:subcoll	| Sub-collection “subcoll” under resource “id” |
| /api/:coll/:id/:subcoll/:subid	| The resource “subid” inside “subcoll” |


- Path examples:
    - ```/api/GoT/seasons```
    - ```/api/GoT/characters/CH_12```
    - ```/api/GoT/characters/CH_12/scenes```
    
    
- Query string:

"On the internet, a query string is the part of a uniform resource locator (URL) which assigns values to specified parameters. The query string commonly includes fields added to a base URL by a Web browser or other client application, for example as part of an HTML form.

A web server can handle a Hypertext Transfer Protocol request either by reading a file from its file system based on the URL path or by handling the request using logic that is specific to the type of resource. In cases where special logic is invoked, the query string will be available to that logic for use in its processing, along with the path component of the URL." (https://en.wikipedia.org/wiki/Query_string)


- Query string example:
    - ```http://127.0.0.1/api/GoT/characters?characterName=Sansa Stark```
    - maps to
    - ```SELECT * FROM characters where characterName='Sansa Stark'```
    
    
- There is no standard way to specify _project._ A common convent is ```fields=f1,f2,...```


- Full example:
    - ```http://127.0.0.1/api/GoT/characters?characterName=Sansa Stark&fields=characterName,nickName```
    - maps to
    - ```SELECT characterName, nickname FROM characters where characterName='Sansa Stark'```
    
    
- These are very common conventions, which we will use for HW2. Applications and frameworks also use other conventions.

- ```limit``` and ```offset``` implement _pagination._

"Currently, when an HTTP GET request is issued on ... route, all of the table's rows are returned. This may not be a big deal with only 107 rows in ... table, but imagine what would happen if the table contained thousands or millions of rows. Clients such as mobile and web apps generally consume and display only a fraction of the rows available in the database and then fetch more rows when needed — perhaps when a user scrolls down or clicks the "next" button on some pagination control in the UI.

To allow for this, REST APIs need to support a means of paginating the results returned. Once pagination is supported, sorting capabilities become important as data usually needs to be sorted prior to pagination being applied. Additionally, a means of filtering data is very important for performance. Why send data from the database, through the mid-tier, and all the way to the client if it's not needed?" (https://dzone.com/articles/creating-a-rest-api-manual-pagination-sorting-and)


- You have seen that I have to do pagination when submitting queries to MySQL from Jupyter notebooks. If I do not use ```LIMIT,``` the amount of returned data causes the Jupyter notebook/browser to freeze/lock-up.

## Reminder: The Big Picture

| <img src="../../images/Lecture_3_ER_SQL_Relational_v2_7.jpg"> |
| :---: |
| __Project Big Picture__ |


- We extact-transform-load data from several sources into:
    - RDB
    - Neo4J
    - DynamoDB
    - ...
    
- Integrate with other web APIs, e.g. IMDB


- Provide an API and query based visualizations.


- This is a lot of work, and we will do a small fraction but hopefully a fun fraction.

| <img src="./Lecture_5_4.png"> |
| :---: |
| __Project Big Picture__ |

# A Worked Example

## Data Model and Sample Data

| <img src="./uml_inheritance.png"> |
| :---: |
| __UML Inheritance Diagram__ |

- We will use a two table solution, which means:
    - ```people``` is a view.
    - ```student``` and ```faculty``` are tables.
    - The solution is by definition _complete_ because people is a view.
    - We will use constraints to enforce _disjoint._


- I used https://mockaroo.com/ to generate sample student and faculty data.

In [25]:
%sql use W4111;

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
0 rows affected.

[]

- __Students__

In [12]:
%sql select * from students limit 10;

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
10 rows affected.

[('13-5569938', 'Giles', 'Rome', 'grome0@mtv.com', 'GSAS', 132),
 ('81-0192253', 'Jane', 'Durn', 'jdurn1@purevolume.com', 'SEAS', 102),
 ('77-6626734', 'Kary', 'Bewly', 'kbewly2@163.com', 'BC', 243),
 ('40-4207610', 'Freemon', 'Blaszczak', 'fblaszczak3@amazon.co.uk', 'GS', 167),
 ('82-4961403', 'Dionis', 'Pressey', 'dpressey4@dagondesign.com', 'GSAS', 224),
 ('75-2550388', 'Fayre', 'Haberjam', 'fhaberjam5@answers.com', 'CC', 225),
 ('18-4333974', 'Vicky', 'Olden', 'volden6@tumblr.com', 'CC', 56),
 ('70-6051098', 'Cornela', 'Willishire', 'cwillishire7@ed.gov', 'GSAS', 155),
 ('11-1927593', 'Madelon', 'Mallion', 'mmallion8@joomla.org', 'GSAS', 164),
 ('64-6133093', 'Milli', 'Finlayson', 'mfinlayson9@diigo.com', 'GSAS', 91)]

- __Faculty__

In [13]:
%sql select * from faculty limit 10;

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
10 rows affected.

[('67-6522449', 'Ari', 'Burtonwood', 'aburtonwood0@china.com.cn', 'Associate Professor', 'ECON', '2000-10-08 13:47:28'),
 ('18-6166348', 'Max', 'Tipens', 'mtipens1@state.gov', 'Lecturer', 'ECON', '2010-08-02 06:45:10'),
 ('76-5862111', 'Lindsey', 'Yorath', 'lyorath2@tinyurl.com', 'Adjunct Professor', 'CENG', '2001-02-25 07:01:34'),
 ('14-2660148', 'Bartholomew', 'Skittreal', 'bskittreal3@unesco.org', 'Associate Professor', 'CHEM', '2012-10-05 15:45:11'),
 ('48-8790642', 'Karee', 'Weatherhead', 'kweatherhead4@deliciousdays.com', 'Adjunct Professor', 'CENG', '2000-05-02 08:39:36'),
 ('70-3517371', 'Al', 'Hanning', 'ahanning5@edublogs.org', 'Lecturer', 'MATH', '2007-06-29 16:05:00'),
 ('85-0254211', 'Wilow', 'Grundy', 'wgrundy6@geocities.jp', 'Lecturer', 'ECON', '2013-05-21 02:14:37'),
 ('96-4415209', 'Elga', 'Hofer', 'ehofer7@nps.gov', 'Assistant Professor', 'PHYS', '1998-05-21 23:35:10'),
 ('27-3224754', 'Querida', 'Norrey', 'qnorrey8@marriott.com', 'Assistant Professor', 'EENG', '2014-04-20 03:33:59'),
 ('87-4458938', 'Nikolas', 'Pymm', 'npymm9@themeforest.net', 'Adjunct Professor', 'CHEM', '2001-03-11 19:57:18')]

## Person

- We are doing a simple, two-table design $\Rightarrow$ create a ```person``` view.


- A common error is to assume that you should use a ```JOIN.```

| <img src="./join.png"> |
| :---: |
| [JOIN](https://www.essentialsql.com/what-is-the-difference-between-a-join-and-a-union/) |

- If $A = (a_1 , a_2 , ... , a_m) JOIN A = (b_1 , b_2 , ... , b_m), $ produces a table of the form:
<br><br>
\begin{equation}
A \bowtie B = C = (a_1 , a_2 , ... , a_m , b_1 , b_2 , ... , b_m)
\end{equation}

- $C$ is _both an A and a B._


- What we want is a single table that has _rows with the C parts of As_ and _rows with the C parts of Bs._

| <img src="./union2.png"> |
| :---: |
| [UNION](https://www.essentialsql.com/what-is-the-difference-between-a-join-and-a-union/) |

In [17]:
%%sql

create or replace view W4111.people as
select id, first_name, last_name, email, "S" as kind from students
union
select id, first_name, last_name, email, "F" as kind from faculty

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
0 rows affected.

[]

- Let's get some people.

In [20]:
%sql select * from W4111.people order by id asc limit 10;

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
10 rows affected.

[('00-0278046', 'Aurlie', 'Colum', 'acolumny@home.pl', 'F'),
 ('00-1121299', 'Gertrudis', 'Halgarth', 'ghalgarthlk@google.com.au', 'F'),
 ('00-1239907', 'Malinde', 'Doggerell', 'mdoggerellfd@webeden.co.uk', 'S'),
 ('00-1867319', 'Far', 'Ixor', 'fixorgi@bluehost.com', 'F'),
 ('00-2017224', 'Chelsea', 'Germann', 'cgermann95@netscape.com', 'S'),
 ('00-2376480', 'Joyan', 'Dollimore', 'jdollimored8@ustream.tv', 'S'),
 ('00-2815610', 'Isaiah', 'Oldrey', 'ioldreyqr@forbes.com', 'S'),
 ('00-3031363', 'Jeanelle', 'Axelbey', 'jaxelbey5d@yale.edu', 'S'),
 ('00-4130892', 'Lilla', 'Hargreave', 'lhargreave92@liveinternet.ru', 'F'),
 ('00-4345209', 'Jefferson', 'Rivett', 'jrivettiw@yahoo.com', 'S')]

## An Example of a Function

- I like UNIs.


- There are basically three ways resource set/table/relation can get a primary key:
    - The person/application assigns the value based on some rules.
    - The value is generated and not related to the elements data, e.g. UUID, AUTO-INCREMENT.
    - The key is some function/combination of the row's columns.


- First, I am going to make a copy of the tables/views and have them end with ```_two``` for the two-table solution.


- The, I am going to write a __function__ that computes new UNIs.

In [21]:
%sql create table W4111.students_two like W4111.students;

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
0 rows affected.

[]

- I like UNIs.

In [22]:
%%sql
ALTER TABLE `W4111`.`students_two` 
ADD COLUMN `UNI` VARCHAR(12) NULL AFTER `credits`;

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
0 rows affected.

[]

- Now do the same for ```faculty.```

In [23]:
%%sql

create table W4111.faculty_two like W4111.faculty;

ALTER TABLE `W4111`.`faculty_two` 
ADD COLUMN `UNI` VARCHAR(12) NULL AFTER `hiredate`;

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
0 rows affected.
0 rows affected.

[]

- And update our view. I add a discriminator.

In [25]:
%%sql

create or replace view W4111.people_two as
select id, UNI, first_name, last_name, email, "S" as kind from students_two
union
select id, UNI, first_name, last_name, email, "F" as kind from faculty_two

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
0 rows affected.

[]

- How can one "make a UNI?" We can write a function. My logic is basically, ...
    1. The UNI prefix is:
        - The 1st two characters of the first name.
        - Concatenated with the first two letters of the last name.
    2. The suffix is an integer, which is 1 more than the number of UNIs that currently exists with the same prefix. That is,
        - If there are ```UNIs donfe1, donfe2, donfe3,``` then the next "donfe" get ```donfe4.```
        
        
- I could write functions in applications that manipulate the data to do the computation, but ...
    - I have to rely on every programmer knowing the rules.
    - If the rules change, I am going to have to find all the programs and change them.
    
    
- So, the function is going to be "in the database" and "encapsulated" for external applications.

In [26]:
%%sql

USE `W4111`;
DROP function IF EXISTS `compute_uni`;


USE `W4111`;

CREATE DEFINER=`root`@`localhost` FUNCTION `compute_uni`(first_name varchar(64), 
                             last_name varchar(64)) RETURNS varchar(64) 
                            CHARSET utf8mb4 COLLATE utf8mb4_bin
    READS SQL DATA
BEGIN

	DECLARE	fn_chars, ln_chars CHAR(2);
    DECLARE	prefix	CHAR(5);
    DECLARE 	uni_count INT;
    DECLARE   new_uni VARCHAR(16);
    
    /*
        A UNI is of the form:
            - First two characters of first name.
            - First two characters of the last name.
            - The number of existing UNIs with the prefix + 1.
    */
    
    /* Get the 1st two characters of the names. */
    SET fn_chars = lower(SUBSTR(first_name, 1, 2));
    SET ln_chars = lower(SUBSTR(last_name, 1, 2));
    
    /* We want to know how many UNIs are "like" the prefix. For example "dofe%" */
    SET prefix = concat(fn_chars, ln_chars, '%');
    
    /* We have to look at the view people_two to make sure that we see ALL people. */
    SET uni_count = (SELECT count(*) from W4111.people_two WHERE UNI LIKE(prefix));
    SET uni_count = uni_count + 1;
    
    SET new_uni = CONCAT(fn_chars, ln_chars, uni_count);
    
RETURN new_uni; 
END;

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

- Let's test it. I am going to delete the existing data from previous tests and then do some inserts.

In [29]:
%%sql

delete from students_two;
delete from faculty_two;

insert into W4111.students_two
	values(21, "Donald", "Ferguson", "dff@cs.columbia.edu", "CC", 123, compute_uni("Donald","Ferguson"));
    
insert into W4111.students_two
	values(22, "Donald", "Ferguson", "dff@cs.columbia.edu", "CC", 123, compute_uni("Donald","Ferguson"));
    
insert into W4111.students_two
	values(23, "Douglas", "Feldman", "dff@cs.columbia.edu", "CC", 123, compute_uni("Douglas","Feldman"));
    
insert into W4111.students_two
	values(24, "Donald", "Finch", "dff@cs.columbia.edu", "CC", 123, compute_uni("Donald","Finch"));

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
4 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

- Now make some faculty.

In [31]:
%%sql

insert into W4111.faculty_two
	values(31, "Donald", "Ferguson", "dff@cs.columbia.edu", "Adjunct Professor", 
           "COMS", "2018-01-01", compute_uni("Donald","Ferguson"));
    
insert into W4111.faculty_two
	values(32, "Some", "Old Dude", "so_dude@cs.columbia.edu", "Emeritus Professor", 
           "MATH", "1901-01-01", compute_uni("Some","Old Dude"));

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
1 rows affected.
1 rows affected.

[]

- Let's look as some people.

In [32]:
%sql select * from people_two;

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
6 rows affected.

[('21', 'dofe1', 'Donald', 'Ferguson', 'dff@cs.columbia.edu', 'S'),
 ('22', 'dofe2', 'Donald', 'Ferguson', 'dff@cs.columbia.edu', 'S'),
 ('23', 'dofe3', 'Douglas', 'Feldman', 'dff@cs.columbia.edu', 'S'),
 ('24', 'dofi1', 'Donald', 'Finch', 'dff@cs.columbia.edu', 'S'),
 ('31', 'dofe4', 'Donald', 'Ferguson', 'dff@cs.columbia.edu', 'F'),
 ('32', 'sool1', 'Some', 'Old Dude', 'so_dude@cs.columbia.edu', 'F')]

- That's enough testing. We are close enough for government work.

| <img src="./government_work.jpg" width="900px"> |
| :---: |
| __Close enough for government work.__ |

## No Problem $-$ Programmers will call the Function, Right?

- People are stupid.


- "Murphy's Eleventh Law: It is impossible to make anything foolproof because fools are so ingenious."


- People will FORGET to call the function. So, __DO NOT LET THEM SET THE UNI.__


- Write triggers.

In [33]:
%%sql

DROP TRIGGER IF EXISTS `W4111`.`students_two_BEFORE_INSERT`;

USE `W4111`;

CREATE DEFINER = CURRENT_USER TRIGGER `W4111`.`students_two_BEFORE_INSERT`
	BEFORE INSERT ON `students_two` FOR EACH ROW
BEGIN

    DECLARE new_uni VARCHAR(16);
    DECLARE m_txt VARCHAR(128);
    
    set new_uni = W4111.compute_uni(New.first_name, New.last_name);

    set NEW.uni = new_uni;

END;

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [22]:
import pymysql

conn = pymysql.connect(
    host="localhost",
    user="root",
    password="dbuserdbuser",
    cursorclass=pymysql.cursors.DictCursor)
try:
    sql = """
        insert into W4111.students_two 
            values(212, 'Donald', 'Ferguson', 'dff@cs.columbia.edu', 'CC', 123, 'CATDOG');
        """
    cur = conn.cursor()
    rc = cur.execute(sql)
 
    print("Return code = ", rc)
    st = conn.show_warnings()
    print(st)
    conn.commit()

except Exception as e:
    print("I got an exception!")
    st = conn.show_warnings()
    print(st)
    conn.commit()
    print(e)

Return code =  1
()

In [23]:

        
%sql select * from W4111.students_two;

 * mysql+pymysql://dbuser:***@localhost/W4111GoTSolutionClean
5 rows affected.

[('21', 'Donald', 'Ferguson', 'dff@cs.columbia.edu', 'CC', 123, 'dofe5'),
 ('21', 'Douglas', 'Feldman', 'dff@cs.columbia.edu', 'CC', 123, 'dofe7'),
 ('21', 'Donald', 'Finch', 'dff@cs.columbia.edu', 'CC', 123, 'dofi1'),
 ('212', 'Donald', 'Ferguson', 'dff@cs.columbia.edu', 'CC', 123, 'dofe8'),
 ('212', 'Donald', 'Ferguson', 'dff@cs.columbia.edu', 'CC', 123, 'dofe9')]